#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
//请简述大端字节序和小端字节序的概念，设计一个小程序来判断当前机器的字节序
//大端字节序是指数据在内存中存储时，数据低位放在高地址处，数据高位放在低地址处
//小端字节序是指数据在内存中存储时，数据低位放在低地址处，数据高位放在高地址处
//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;
//}
//int main()
//{
//	int ret = 0;
//	//写一段代码告诉我们当前机器的字节序是什么
//	//返回1  小端   返回0   大端
//	ret = check_sys();
//	if (1 == ret)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}

//练习1
//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000
//	//11111111111111111111111101111111
//	//11111111111111111111111110000000  -  补码
//	//10000000 - 整形提升11111111111111111111111110000000 - 补码
//	printf("%u\n",a);//%u打印无符号数
//	return 0;
//}

//练习2
int main()
{
	char a = 128;
	printf("%u\n",a);//%u打印无符号数    127 + 1 就到 -128 因为char只能存-128 - 127    所以打印和上面的结果一样
	return 0;
}